{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
        "tag":"about",
        "patterns":[
          "who are you?",
          "who build you?",
          "Who is your founder?",
          "who founded you?",
          "who is your father?"
        ],
        "responses":[
          "I am Mediped chatbot founded by Mediped group of companies.I am capable of solving your queries about different diseases."
        ]
    },

    {
      "tag": "items",
      "patterns": [
        "What do you do?",
        "What kind of work do you do?",
        "What is your work?"
      ],
      "responses": [
        "We do Disease Prediction and Suggestion",
        "We predict the severeness of disease"
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "How to pay you?",
        "How do you accept payments?",
        "Do you take credit cards?",
        "Do you accept Mastercard?",
        "Can I pay with Paypal?",
        "Are you cash only?",
        "How do you want to accept paymenta",
        "Do you accept UPI?"
      ],
      "responses": [
        "We accept VISA, Mastercard and Paypal,UPI etc..",
        "We accept most major credit cards, and Paypal,UPI .."
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "Who are your founders?",
        "Who created you?",
        "Who are your team members?"
      ],
      "responses": [
        "Abhishek,Alok,Ayush and Akash has created me. I am here to help you.",
        "My team members are Abhishek,Ayush,Akash and Alok."
      ]
    },
    {
      "tag": "Dengue Symptoms",
      "patterns": [
        "Tell me about dengue",
        "what is dengue?",
        "what are symptoms of dengue?",
        "what is Cure of dengue"
      ],
      "responses": [
        "Ask doctor but here are some remedies:Dengue fever is a mosquito-borne viral infection that causes flu-like symptoms. The symptoms can vary from mild to severe and may include:High Fever: Sudden onset of high fever, often reaching up to 104째F (40째C).Severe Headache: Intense headaches, especially behind the eyes.Pain Behind the Eyes: Pain, often described as a deep ache, behind the eyes.Fatigue: Extreme tiredness and fatigue.",
        "Ask doctor but here are some remedies:Dengue fever is a mosquito-borne viral infection that causes flu-like symptoms. The symptoms can vary from mild to severe and may include: Nausea and Vomiting: Nausea, vomiting, and loss of appetite.Skin Rash: A rash may appear two to five days after the onset of fever, typically on the arms, legs, and torso.Mild Bleeding: Minor bleeding, such as nosebleeds, bleeding gums, or easy bruising."
      ]
    },

    {
       "tag":"Dengue Cure",
       "patterns":[
        "How to cure dengue",
        "What is treatment of dengue"
       ],
       "responses":[
        "Ask doctor but here are some remedies:Fluid Replacement: Adequate hydration is crucial, especially in cases where there is vomiting, diarrhea, or high fever. Oral rehydration solutions or intravenous fluids may be administered to prevent dehydration.Pain Relief: Pain relievers such as acetaminophen (paracetamol) are typically used to reduce fever and alleviate muscle and joint pain. Nonsteroidal anti-inflammatory drugs (NSAIDs) such as ibuprofen or aspirin should be avoided, as they can increase the risk of bleeding.Bed Rest: Patients are advised to get plenty of rest to help the body fight the infection and recover.",
        "Ask doctor but here are some remedies:Monitoring: Patients with dengue fever, especially those with severe symptoms, should be closely monitored for any signs of complications such as severe bleeding, dehydration, or organ impairment.Hospitalization: Severe cases of dengue fever, particularly those progressing to dengue hemorrhagic fever (DHF) or dengue shock syndrome (DSS), may require hospitalization for intensive care and monitoring.Prevention of Mosquito Bites: Since dengue fever is spread by mosquitoes, it's important to prevent mosquito bites to avoid further transmission of the virus. This includes using mosquito repellents, wearing long sleeves and pants, and using mosquito nets or screens."
       ]
    },
    {
      "tag":"Malaria Cause",
      "patterns":[
        "Why do malaria happens?",
        "what are symptoms of malaria?",
        "what happens when you have malaria?",
        "what are problems when malaria?",
        "what are different side effects of malaria"
      ],
      "responses":[
        "Ask doctor but here are some remedies:Malaria symptoms can vary depending on the species of the parasite causing the infection, the individual's immunity, and other factors. Chills: Chills often accompany the fever and may be severe.Headache: Malaria can cause intense headaches, which may be persistent.Fatigue: Malaria can cause extreme tiredness and weakness.Muscle and joint pain: Aching muscles and joints are often reported, resembling flu-like symptoms.",
        "Ask doctor but here are some remedies:Abdominal pain: Some individuals may experience abdominal discomfort, including diarrhea.Anemia: Severe malaria infections can lead to anemia due to the destruction of red blood cells.Jaundice: Yellowing of the skin and eyes can occur in cases of severe malaria, indicating liver involvement."
      ]
    },
    {
      "tag":"malaria cure",
      "patterns":[
        "How to cure malaria",
        "what are medicines of malaria",
        "how to treat malaria"
      ],
      "responses":[
        "Ask doctor but here are some remedies:The treatment of malaria typically involves the use of antimalarial medications. The choice of medication and duration of treatment depend on several factors, including the species of malaria parasite causing the infection, the severity of the illness, the patient's age, and whether there are any complications or resistance to specific drugs. Here are some common antimalarial medications used for treatment: Artemisinin-based combination therapies (ACTs): These are currently the most effective treatments for uncomplicated malaria caused by Plasmodium falciparum, which is the most deadly species of malaria parasite. ACTs combine an artemisinin derivative with another antimalarial drug to ensure both rapid reduction of parasite numbers and elimination of remaining parasites.Chloroquine: This was once a widely used antimalarial drug, particularly for uncomplicated cases caused by Plasmodium vivax and Plasmodium malariae. However, chloroquine resistance is widespread in many parts of the world, and it is no longer recommended for treating infections caused by Plasmodium falciparum in most regions.",
        "Ask doctor but here are some remedies:Quinine: Quinine is an older antimalarial drug that is still used in certain circumstances, such as for treating severe malaria or when other medications are not available or appropriate. It's often used in combination with other drugs.Atovaquone-proguanil: This combination medication is effective against both chloroquine-resistant Plasmodium falciparum and Plasmodium vivax.Doxycycline, Clindamycin, and other antibiotics: These medications may be used as alternatives or in combination with other antimalarial drugs, particularly for treating certain types of malaria or when the patient cannot tolerate other medications."
      ]
    },
    {
      "tag":"Chikangunia symptoms",
      "patterns":[
        "what are different symptoms of chikangunia?",
        "what are symptoms of chikangunia?",
        "why chikangunia occurs?",
        "what are side effects of chikangunia?"
      ],
      "responses":[
        "Chikungunya is a viral infection transmitted to humans through the bite of infected mosquitoes, primarily the Aedes aegypti and Aedes albopictus species. The symptoms of chikungunya typically appear 3 to 7 days after being bitten by an infected mosquito. Common symptoms include: Fever: Chikungunya infection often starts with a sudden onset of high fever, typically above 102째F (38.9째C).Joint pain: Severe joint pain, often affecting multiple joints, is a hallmark symptom of chikungunya. The pain can be debilitating and may persist for weeks to months, and sometimes even longer, after the acute phase of the illness has passed. Joints commonly affected include the wrists, ankles, knees, and small joints of the hands and feet.Muscle pain: Muscle pain, which can be severe, is another common symptom. It often accompanies joint pain.Headache: Many individuals with chikungunya experience headaches, which can range from mild to severe.Rash: Some people develop a rash characterized by red, flat or raised spots on the skin. The rash may be itchy and typically appears on the trunk and limbs."
      ]
    },
    {
      "tag":"Chikangunia cure",
      "patterns":[
        "what is treatment of chikangunia",
        "How to cure chikangunia",
        "what are cure of chikangunia"
      ],
      "responses":[
        "Ask doctor but here are some remedies:Currently, there is no specific antiviral treatment available for chikungunya. Treatment primarily focuses on relieving symptoms and providing supportive care to help the patient recover. Here are some common approaches to managing chikungunya infection: Pain relief: Over-the-counter pain relievers such as acetaminophen (paracetamol) are often recommended to alleviate fever and joint pain. Nonsteroidal anti-inflammatory drugs (NSAIDs) like ibuprofen or naproxen may also be used, but caution should be exercised, especially in individuals with a history of stomach ulcers or kidney problems, and these should be avoided in individuals with dengue fever until dengue is ruled out.Rest: Adequate rest is essential to help the body fight the infection and recover from symptoms such as fatigue.Hydration: Drinking plenty of fluids helps prevent dehydration, especially if the patient has a fever, is experiencing vomiting, or is unable to eat due to mouth ulcers.Cold compresses: Applying cold packs or cool compresses to swollen and painful joints can help reduce inflammation and alleviate discomfort."
      ]
    },
    {
      "tag":"contacts",
      "patterns":[
        "How can I contact your your team?",
        "what are your contact details",
        "How to reach you",
        "How to contact your team?",
        "How to contact your company?"
      ],
      "responses":[
        "our email address is : help@mediped.org.in our contact number is 123456789 You can contact through Contact Section of our app by Providing you email address and ask your query there and our team will contact you"
      ]
    },
    {
      "tag":"Payment failing",
      "patterns":[
        "My payment failed,what to do now",
        "payment is failing",
        "why my payment is failing",
        "why payment failed"
      ],
      "responses":[
         "Contact to email:helpMediped@gmail.com or contact phone number:123456789 or contact our team at Contact section of our application"
      ]
    },
    {
      "tag":"Headache",
      "patterns":[
        "I am having a headache. suggest medicine",
        "Suggest some medicine for my headache",
        "Give me some medicine for headache",
        "Medicines of headache",
        "Suggestion to reduce headache",
        "Give me some suggestion to reduce headache",
        "cure of headache",
        "removal of headache"
      ],
      "responses":[
        "Ask doctor but here are some remedies:Acetaminophen (Tylenol): Effective for mild to moderate headaches.",
        "Ask doctor but here are some remedies:Some medications combine analgesics with caffeine or other ingredients to enhance their effectiveness. Examples include Excedrin (acetaminophen, aspirin, caffeine) and Advil Migraine (ibuprofen, caffeine).",
        "Ask doctor but here are some remedies:Nonsteroidal Anti-Inflammatory Drugs (NSAIDs):Ibuprofen (Advil, Motrin) Naproxen (Aleve)Aspirin: Particularly helpful for tension headaches and migraines.",
        "Ask doctor but here are some remedies:If tension in the neck and shoulders contributes to headaches, muscle relaxants like cyclobenzaprine (Flexeril) may be prescribed."
      ]
    },
    {
      "tag":"Stomache",
      "patterns":[
        "I am getting stomache",
        "I am getting pain in my stomach",
        "I am getting some stomach pain",
        "Medicines to cure stomach pain",
        "Medicine for stomach pain"
      ],
      "responses":[
        "Ask doctor but here are some remedies:Stomach pain can have various causes, including indigestion, gastritis, gastroenteritis, peptic ulcers, or other gastrointestinal issues. The appropriate treatment depends on the underlying cause and severity of the pain. It's essential to consult with a healthcare professional for a proper diagnosis and treatment plan tailored to your individual needs. That said, here are some over-the-counter medications commonly used to alleviate stomach pain and related symptoms:",
        "Ask doctor but here are some remedies:Antacids:Antacids can help neutralize stomach acid and provide relief from heartburn, indigestion, and acid reflux. Common antacids include:Tums (calcium carbonate) Rolaids (calcium carbonate and magnesium hydroxide)Maalox (aluminum hydroxide and magnesium hydroxide)Mylanta (aluminum hydroxide and magnesium hydroxide)",
        "Ask doctor but here are some remedies:H2 Receptor Antagonists:H2 blockers reduce the production of stomach acid and can help relieve symptoms of heartburn and acid reflux. Examples include:Famotidine (Pepcid)Ranitidine (Zantac) - Note: Zantac has been discontinued due to concerns about NDMA contamination. Consult with a healthcare professional for alternative options.",
        "Ask doctor but here are some remedies:Gas Relievers:For stomach pain caused by gas and bloating, over-the-counter gas relievers may provide relief. Examples include:Simethicone (Gas-X, Mylicon)Activated charcoal"
      ]
    },
    {
      "tag":"Fever",
      "patterns":[
         "I am having fever. Suggest some remedy",
         "give some medicines for fever",
         "fever medicine",
         "medicines for fever",
         "fever remedy",
         "fever cure",
         "fever",
         "fever medicine",
         "cure of fever",
         "why I am having fever",
         "I am having fever.Give me some medicine"
      ],
      "responses":[
        "Ask doctor but here are some remedies :Some herbal remedies, such as ginger, echinacea, elderberry, and chamomile, are believed to have immune-boosting properties and may help alleviate fever symptoms. Consult with a healthcare professional before using herbal remedies, especially if you have underlying health conditions or are taking medications.",
        "Ask doctor but here are some remedies:Acetaminophen (Tylenol) or ibuprofen (Advil, Motrin) can help reduce fever and alleviate discomfort. Follow the recommended dosage instructions and consult a healthcare professional if you have any underlying medical conditions or are taking other medications.",
        "Ask doctor but here are some remedies:Drink plenty of fluids, such as water, herbal teas, clear broths, or electrolyte-rich drinks like sports drinks or oral rehydration solutions, to prevent dehydration.",
        "Ask doctor but here are some remedies:Apply cool compresses or damp washcloths to your forehead, neck, and armpits to help lower your body temperature and provide relief from fever discomfort."
      ]
    },
    {
       "tag":"Common Cold",
       "patterns":[
        "what are symptoms of common cold",
        "how to prevent common cold",
        "cure of cough",
        "cure of common cold",
        "medicine of common cold"
       ],
       "responses":[
        "Ask doctor but here are some remedies:The common cold is a viral infection that affects the upper respiratory tract, causing symptoms such as a runny or stuffy nose, sore throat, cough, sneezing, and sometimes fever. While there is no cure for the common cold, several over-the-counter medications and home remedies can help alleviate symptoms and support the body's immune response.",
        "Ask doctor but here are some remedies:Home Remedies:Stay Hydrated: Drink plenty of fluids, such as water, herbal teas, broth, or electrolyte-rich drinks, to stay hydrated and help loosen congestionRest: Get plenty of rest to support your immune system's ability to fight off the infectionSaline Nasal Sprays/Drops: Saline nasal sprays or drops can help moisturize nasal passages, thin mucus, and alleviate nasal congestionSteam Inhalation: Inhaling steam from a bowl of hot water or using a humidifier can help relieve nasal congestion and soothe irritated nasal passagesGargling with Salt Water: Gargling with warm salt water can help soothe a sore throat and reduce throat inflammation.",
        "Ask doctor but here are some remedies:Over-the-Counter (OTC) Medications:Decongestants: These help reduce nasal congestion by constricting blood vessels in the nasal passages. Examples include pseudoephedrine (Sudafed) and phenylephrine (Sudafed PE)Antihistamines: These help relieve sneezing, runny nose, and itching by blocking histamine, a chemical released during an allergic reaction. Examples include loratadine (Claritin), cetirizine (Zyrtec), and diphenhydramine (Benadryl)Pain Relievers/Fever Reducers: Over-the-counter pain relievers such as acetaminophen (Tylenol) or ibuprofen (Advil, Motrin) can help alleviate headache, sore throat, and fever associated with a coldCough Suppressants: Dextromethorphan (Robitussin DM) can help suppress coughing and provide relief from cough sym",
        "Ask doctor but here are some remedies:Herbal Remedies:Echinacea: Some studies suggest that echinacea may help reduce the severity and duration of cold symptoms, although results are mixedZinc: Zinc lozenges or nasal sprays may help reduce the duration and severity of cold symptoms when taken at the onset of a cold."
       ]
    },
    {
        "tag":"Doctors",
        "patterns":[
          "Is your chat reliable enough",
          "is chat doctor's advice",
          "is my app good for help",
          "is this app good",
          "Is this app good for help",
          "app good",
          "app better",
          "is your chat app is good for help",
          "is your chat app good for people",
          "chat app good",
          "doctors giving advice on your chat app",
          "is chat app giving good advice"
          ,"doctors advice on disease"
        ],
        "responses":[
          "This chat app relaible enough.All the answers are trained on doctor's advice.You should see a doctor and can follow advice given here"
        ]
    }
    ,
    {
         "tag":"Broken bones",
         "patterns":[
          "bone broken!",
          "my hand is broken, suggest some remedy now",
          "bone broken",
          "my leg bone broken down",
          "My leg bone is broken",
          "wrist bone is broken",
          "bone broken",
          "wrist broken",
          "pelvis bone broken",
          "my nose bone broken",
          "my earbone broken",
          "my nosebone broken,suggest me some remedy now",
          "leg is broken down suggest me some remedy now"
         ],
         "responses":[
            "First tightly hold the broken area firmly with help of warm tape and solid object and then consult the doctor"
         ]
    },
    {
         "tag":"snake bite",
         "patterns":[
          "Snake bite",
          "I have got snake bite",
          "snake has bitten me"
         ],
         "responses":[
          "Can you give me the snake name"
         ]
    },
    {
      "tag":"type",
      "patterns":[
        "snake is Rattle Snake",
        "snake is Viper",
        "snake is cobra",
        "cobra",
        "Rattle Snake",
        "viper"
      ],
      "responses":[
        "get wash your bitten area and consult the doctor"
      ]
    },
    {
      "tag":"mental health",
      "patterns":[
        "I am suffering from tension",
        "depression",
        "I am suffering from mental health",
        "I am disturbed"
      ],
      "responses":[
         "You should read books,focus on your mental health and consult the mental health doctor"
      ]
    }
  ]
}
